import pyautogui
import keyboard
import time
import math

# pip install time -i http://mirrors.aliyun.com/pypi/simple/ --trusted-host mirrors.aliyun.com


def to_radian(value: float) -> float:
    """
    :param value: Значение в градусах
    :return: Значение в радианах
    """
    return round(value * math.pi / 180, 2)


def br_twin_tandem_rdtt():
    br_twin_tandem_rdtt = [
        [679, 417],
        [940, 418],
        [892, 452],
        [974, 416],
        [888, 500],
        [890, 512],
        [888, 524],
        [889, 538],
        [891, 643],
        [888, 657],
        [889, 669],
        [1081, 563],
        [1082, 645],
        [1080, 657],
        [1082, 668]]
    for xy in br_twin_tandem_rdtt:
        move_and_click(xy[0], xy[1])

def br_solo_tandem_rdtt():
    br_solo_tandem_rdtt = [
        [682, 419],
        [1082, 500],
        [1081, 512],
        [1079, 525],
        [1083, 538],
        [1080, 642],
        [1079, 655],
        [1081, 671],
    ]
    for xy in br_solo_tandem_rdtt:
        move_and_click(xy[0], xy[1])

    next()


    # Окно оптимизации
    opt_param = [
        [873, 418],
        [874, 445],
        [875, 473],
    ]
    no_opt_param = [
        [698, 571],
        [697, 594],
        [696, 615],
        [695, 638],
    ]
    move_and_click(opt_param[i_opt][0], opt_param[i_opt][1])
    if i_opt == 0:
        # Шкварцова
        move_and_text(1035, 514, str(var_opt))
    elif i_opt == 1:
        # Недлера Манна
        move_and_text(1035, 514, str(var_opt))
    elif i_opt == 2:
        # без оптимизации
        move_and_click(no_opt_param[i_no_opt][0], no_opt_param[i_no_opt][1])
        move_and_text(1069, 614, str(var_opt))
    else:
        raise ValueError("значение i_param некорректно")

    next()

    # целевая функция и ограничения второго рода
    # параметр целевой функции
    param_zel_f = [
        [730, 420],
        [727, 445],
        [893, 418],
        [894, 447],
        [1060, 420],
    ]

    param_coord = [
        [1070, 495],     # параметр стартовая масса
        [1056, 520],     # параметр дальность
        [1069, 547],     # параметр удлинение
        [1070, 570],     # параметр калибр
        [1069, 598],     # параметр длина
        [1068, 618],     # параметр скоростной напор при разделении
        [1080, 645],     # параметр высота апогея
        [1070, 668],     # параметр высота перигея
        [1086, 686],     # параметр продолжительность активного участка
    ]

    # варьируемые параметры
    var_param = [
        [690, 423],     # варьируем диаметр РБ
        [688, 437],     # варьируем конечный угол
        [690, 448],     # варьируем угол в конце разворота
        [870, 421],     # варьируем относительная масса топлива
        [874, 435],     # варьируем тяговооружённость
        [871, 449],     # варьируем давление в КС
        [876, 463],     # варьируем давление на срезе сопла
        [873, 474],     # варьируем диаметр ступени
        [877, 489],     # варьируем соотношение компонентов
    ]

    if i_opt == 1 or i_opt == 0:
        # если шкварцов или недлер-манн
        move_and_click(param_zel_f[i_zel_f][0], param_zel_f[i_zel_f][1])
        for i in range(len(param_coord)):
            if param_coord_var[i] != "1e+030":
                move_and_text(param_coord[i][0], param_coord[i][1], param_coord_var[i])
        next()

        for i in range(len(var_param)):
            if i_var_param[i] == 1:
                move_and_click(var_param[i][0], var_param[i][1])
        next()

    # Окно начальных параметров
    #скорость
    move_and_text(1084, 425, str(v))
    #высота
    move_and_text(1078, 460, str(h))
    #угол
    move_and_text(1085, 490, str(tetha))

    next()

    # Окно цели
    # нет цели
    move_and_click(681, 386)

    next()

    # Окно программы АУ
    # по умолчанию
    move_and_click(896, 486)

    next()
    next()

    # Окно конструкционные схемы и материалы

    # головной отсек
    move_and_click(763, 370)
    move_and_click(904, 402)
    # масса ГО
    move_and_text(1350, 372, str(m_go))
    # калибр ГО
    move_and_text(1351, 396, str(D_go))
    # длина ГО
    move_and_text(1347, 417, str(l_go))
    # притупление
    move_and_text(1357, 442, str(x_go))
    accept()

    # устройство отделения
    move_and_click(766, 384)
    param = [
        [1049, 444],
        [1050, 469],
        [1049, 489],
        [1051, 514],
        [1050, 539],
    ]
    move_and_click(param[i_param][0], param[i_param][1])
    accept()

    # параметры ступени
    move_and_click(744, 419)
    # относительная масса топлива
    move_and_text(1216, 460, str(m_t))
    # тяговооруженность
    move_and_text(1220, 481, str(p_))
    # диаметр
    move_and_text(1222, 509, str(D))
    accept()




    # приборы управления
    move_and_click(789, 434)
    move_and_text(1238, 469, str(sko))
    accept()

    # приборный отсек
    move_and_click(754, 448)
    [754, 448]
    po_param = [
        [922, 396],
        [923, 420],
        [921, 442],
    ]
    move_and_click(po_param[i_po_param][0], po_param[i_po_param][1])

    mat_param = [
        [1154, 394],
        [1153, 415],
        [1152, 432],
        [1155, 451],
        [1154, 472],
        [1155, 488],
        [1152, 510],
        [1154, 526],
        [1152, 547],
    ]
    move_and_click(mat_param[i_mat_param][0], mat_param[i_mat_param][1])
    accept()


    # топливо РДТТ
    for_lab_2 = [
            [756, 463],
            [913, 376],
            [914, 554],
        ]
    for xy in for_lab_2:
        move_and_click(xy[0], xy[1])
    accept()

    # РДТТ
    for_lab_2 = [
        [742, 475],
        [913, 386],
    ]
    for xy in for_lab_2:
        move_and_click(xy[0], xy[1])


    move_and_text(1283, 516, str(p_kc))
    move_and_text(1282, 541, str(p_sr))
    accept()

    # хвостовой отсек
    move_and_click(771, 499)
    accept()


def move_and_click(x, y):
    pyautogui.moveTo(x, y)
    pyautogui.leftClick()


def move_and_text(x, y, text):
    pyautogui.moveTo(x, y)
    pyautogui.doubleClick()
    for i in range(5):
        pyautogui.press('backspace')
    keyboard.write(text)

def next():
    pyautogui.moveTo(1038, 746)
    pyautogui.leftClick()


def accept():
    pyautogui.moveTo(933, 739)
    pyautogui.leftClick()


# ----------------------------------!!!!!!!!!!!!!!!!!!!!!!!!!!
# ----------------------------------!!!!!!!!!!!!!!!!!!!!!!!!!!
# ----------------------------------!!!!!!!!!!!!!!!!!!!!!!!!!!

# скорость старта
v = 0

# высота старта
h = 30000

# угол старта
tetha = to_radian(0)

# относительная масса топлива
m_t = 0.7

# тяговооруженность
p_ = 3.5

# диаметр
D = 1

# масса ГО
m_go = 590

# калибр ГО
D_go = 1

# длина ГО
l_go = 1.2

# притупление ГО
x_go = 0.2

# метод оптимизации
i_opt = 1
    # 0 - Шкварцова
    # 1 - Недлера-Манна
    # 2 - без отпимизации

# что задано для метода без оптимизации
i_no_opt = 0
    # 0 - задана масса
    # 1 - задана дальность
    # 2 - задана длина
    # 3 - задана относительная масса топлива

# что задано для метода без оптимизации, величина
# или коэффициент штрафа для остальных методов
var_opt = 10

# тип разделения
i_param = 3
    # 0 - расталкивающий
    # 1 - ускоряющий
    # 2 - тормозящий
    # 3 - противосопла РДТТ
    # 4 - противосопла бака

# какая целевая функция
i_zel_f = 0
    # 0 - стартовая масса
    # 1 - дальность
    # 2 - масса ЗУ
    # 3 - масса ПН
    # 4 - высота перигея

# значения ограничеий второго рода
# если стоит "1e+030" - ничего не менять
param_coord_var = [
    "20000",  # параметр стартовая масса
    "1e+030",  # параметр дальность
    "1e+030",  # параметр удлинение
    "2",  # параметр калибр
    "1e+030",  # параметр длина
    "1e+030",  # параметр скоростной напор при разделении
    "1e+030",  # параметр высота апогея
    "1e+030",  # параметр высота перигея
    "1e+030",  # параметр продолжительность активного участка
]

# какие параметры варьируем
# 1 - варьируем
# 2 - оставляем
i_var_param = [
    1,  # варьируем диаметр РБ
    0,  # варьируем конечный угол
    0,  # варьируем угол в конце разворота
    1,  # варьируем относительная масса топлива
    1,  # варьируем тяговооружённость
    0,  # варьируем давление в КС
    0,  # варьируем давление на срезе сопла
    0,  # варьируем диаметр ступени
    0,  # варьируем соотношение компонентов
]

# среднее квадратичное рассеивание
sko = 200
#конструкция
i_po_param = 0
    # 0 - стрингерная
    # 1 - лонжеронная
    # 2 - шпангоутная

i_mat_param = 1
    # 0 - СП-43
    # 1 - Х18Н9Т
    # 2 - АМг6
    # 3 - Д16Т
    # 4 - ВТ15
    # 5 - стеклопластик
    # 6 - органопластик
    # 7 - углепластик
    # 8 - другой

# давление камеры сгорания
p_kc = 4000000

# давление на срезе
p_sr = 100000


# ----------------------------------!!!!!!!!!!!!!!!!!!!!!!!!!!
# ----------------------------------!!!!!!!!!!!!!!!!!!!!!!!!!!
# ----------------------------------!!!!!!!!!!!!!!!!!!!!!!!!!!

if __name__ == "__main__":
    X_CURSOR = 0,
    Y_CURSOR = 0
    while True:
        if keyboard.is_pressed('home'):
            # br_twin_tandem_rdtt()
            br_solo_tandem_rdtt()
            break
        if keyboard.is_pressed('scrlk'):
            x, y = pyautogui.position()
            if x != X_CURSOR and y != Y_CURSOR:
                X_CURSOR, Y_CURSOR = x, y
                print([X_CURSOR, Y_CURSOR])
        if keyboard.is_pressed('ins'):
            break